Repository: situmtech/ios-swift-library-wayfinding
Catalog: SitumWayfinding/Localizations/*.lproj/Localizable.strings
Languages: ar, es, fr, he, ja, pl, pt, tr

# alert.error.building.message
source: An unexpected error ocurred while downloading the building's information. Please try again.
ar: حدث خطأ غير متوقع أثناء تحميل معلومات المبنى. الرجاء المحاولة مرة أخرى.
es: Ha ocurrido un error en la descarga de la información del edificio. Por favor, vuelve a intentarlo
fr: Une erreur imprévue s'est produite lors de la connexion avec Amazon. Merci de tenter à nouveau de vous connecter.
he: אירעה שגיאה בלתי צפויה בעת הורדת מידע הבניין. בבקשה נסה שוב.
ja: ロビーの読み込み中にエラーが発生しました。もう一度お試しください。
pl: Podczas pobierania informacji o budynku wystąpił nieoczekiwany błąd. Spróbuj ponownie.
pt: Ocorreu um erro inesperado ao baixar as informações do edifício. Por favor, tente novamente.
tr: Bina bilgileri indirilirken beklenmeyen bir hata oluştu. Lütfen tekrar deneyin.

# alert.error.building.title
source: Error obtaining building info
ar: خطأ في الحصول على معلومات البناء
es: Error obteniendo la información del edificio
fr: Impossible d'obtenir les infos sur l'utilisateur
he: שגיאה בהשגת מידע בנייה
ja: ビル情報取得エラー
pl: Błąd podczas uzyskiwania informacji o budynku
pt: Erro ao obter informações de construção
tr: Bina bilgileri alınırken hata oluştu

# alert.error.title
source: Error
ar: خطأ
he: שְׁגִיאָה
ja: エラー
pl: Błąd
pt: Erro
tr: Hata

# alert.loading.message
source: Hold on for a moment
ar: انتظر لحضة
es: Espera un momento
fr: Accrochez-vous à un moment
he: תחזיקי רגע
ja: ちょっと待って
pl: Zatrzymaj się na chwilę
pt: Espere por um momento
tr: bir an için bekle

# alert.loading.title
source: Loading
ar: جار التحميل
es: Cargando
fr: Chargement
he: טעינה
ja: 読み込み中
pl: Ładowanie
pt: Carregando...
tr: Yükleniyor

# generic.cancel
source: Cancel
ar: إلغاء
es: Cancelar
he: לְבַטֵל
ja: キャンセル
pl: Anuluj
pt: cancelar
tr: İptal

# generic.ok
source: Ok
ar: موافق
he: בסדר
ja: はい
tr: Tamam

# navigation.lessThanMinutes
source: less than %d min
ar: أقل من %d دقيقة
es: menos de %d min
fr: moins d’une minute
he: פחות מ %d דקות
ja: %d 分未満
pl: mniej niż %d min
pt: Menos de %d min
tr: %d dakikadan az

# navigation.remainingHours
source: %d h
ar: %d ساعة
he: %d שעות
ja: %d 時間
pl: %d godz
tr: %d saat

# navigation.remainingMinutes
source: %d m
ar: %d د
es: %d min
fr: %d min
he: %d דקות
ja: %d 分
pl: %d min
pt: %d min.
tr: %d dakika

# navigationError.noAvailableRoute
source: There is no route between the selected locations. Try to compute a different route or to switch accessibility mode
ar: لا يوجد مسار بين المواقع المحددة. حاول حساب مسار مختلف أو تبديل وضع الوصول
es: No existe una ruta entre las localizaciones seleccionadas. Intenta otra ruta o cambia al modo de accesibilidad
fr: Il n'y a pas d'itinéraire entre les emplacements sélectionnés. Essayez de calculer une route différente ou de changer de mode d'accessibilité
he: אין מסלול בין המיקומים שנבחרו. נסה לחשב מסלול אחר או להחליף מצב נגישות
ja: 選択した場所の間にルートがありません。別のルートを計算するか、アクセシビリティモードを切り替えてください。
pl: Nie ma trasy między wybranymi lokalizacjami. Spróbuj obliczyć inną trasę lub przełączyć tryb ułatwień dostępu
pt: Não há nenhuma rota entre os locais selecionados. Tente calcular uma rota diferente ou alternar o modo de acessibilidade
tr: Seçilen konumlar arasında rota yok. Farklı bir rota hesaplamayı veya erişilebilirlik modunu değiştirmeyi deneyin

# navigationError.noDestinationSelected
source: There is no destination currently selected, the navigation cannot be started. Please select a POI (or longpress to create a custom one) and try again.
ar: لا توجد وجهة محددة حاليًا، لا يمكن بدء التنقل. الرجاء تحديد POI (أو اضغط لفترة طويلة لإنشاء واحد مخصص) وحاول مرة أخرى.
es: No hay ninguna localización seleccionada actualmente, la navegación no puede comenzar. Por favor, selecciona un POI (o realiza una pulsación larga para una localización personalizada) e inténtalo de nuevo,
fr: Il n'y a pas de destination actuellement sélectionnée, la navigation ne peut pas être démarrée. Veuillez sélectionner un POI (ou appuyez longuement pour en créer une) et réessayez.
he: כרגע לא נבחר יעד, לא ניתן להתחיל את הניווט. אנא בחר POI (או לחץ לחיצה ארוכה כדי ליצור אחד מותאם אישית) ונסה שוב.
ja: 現在選択されている目的地がないため、ナビゲーションを開始できません。POI（またはカスタムのものを作成するには長押し）を選択して再度お試し下さい。
pl: Obecnie nie wybrano punktu docelowego, nie można rozpocząć nawigacji. Wybierz punkt POI (lub naciśnij długo, aby utworzyć własny) i spróbuj ponownie.
pt: Não há destino selecionado, a navegação não pode ser iniciada. Por favor, selecione um POI (ou toque longo para criar um customizado) e tente novamente.
tr: Şu anda seçili bir hedef yok, navigasyon başlatılamıyor. Lütfen bir İÇN seçin (veya özel bir tane oluşturmak için uzun basın) ve tekrar deneyin.

# navigationError.outdoorOrigin
source: User actual location is outdoor, navegation is only avaialble indoor.
ar: الموقع الفعلي للمستخدم هو خارج، والملاحة متاحة فقط في الداخل.
es: La ubicación actual es en el exterior, la navegación solo está disponible en ubicaciones interiores
fr: L'emplacement réel de l'utilisateur est à l'extérieur, la navigation n'est disponible qu'à l'intérieur.
he: המיקום בפועל של המשתמש הוא חיצוני, ניווט זמין רק בתוך הבית.
ja: ユーザー実際の場所は屋外、ナビゲーションのみ屋内利用可能です。
pl: Obecna lokalizacja użytkownika znajduje się na zewnątrz, nawigacja jest dostępna tylko w pomieszczeniach.
pt: A localização atual do usuário é exterior, a navegação só está disponível no interior.
tr: Kullanıcının gerçek konumu dış mekandadır, navigasyon yalnızca iç mekanda kullanılabilir.

# navigationError.outsideBuilding
source: The user is not currently detected on the route and is out of the building. Please go back to resume navigation.
ar: المستخدم غير مكتشف حاليا على الطريق وهو خارج المبنى. الرجاء العودة لاستئناف التصفح.
es: El usuario no está actualmente en la ruta y está fuera el edificio. Por favor, vuelve a inicar la navegación
fr: L'utilisateur n'est pas actuellement détecté sur la route et est en dehors du bâtiment. Veuillez revenir à la reprise de la navigation.
he: המשתמש אינו מזוהה כעת במסלול והוא מחוץ לבניין. אנא חזור כדי לחדש את הניווט.
ja: ユーザーは現在ルート上で検出されておらず、建物の外にいます。ナビゲーションを再開するには戻ってください。
pl: Użytkownik jest poza trasą i znajduje się poza budynkiem. Wróć, aby wznowić nawigację.
pt: O usuário não está detectado na rota e está fora do edifício. Por favor, volte para retomar a navegação.
tr: Kullanıcı şu anda rotada algılanmadı ve binanın dışında. Navigasyona devam etmek için lütfen geri dönün.

# navigationError.positionUnknown
source: User actual location is unknown, please activate the positioning before computing a route and try again.
ar: الموقع الفعلي للمستخدم غير معروف، يرجى تنشيط الموقع قبل حساب المسار وحاول مرة أخرى.
es: La localización actual es desconocida, por favor activa el posicionamiento antes de calcular la ruta y vuelve a intentarlo.
fr: L'emplacement actuel de l'utilisateur est inconnu, veuillez activer le positionnement avant de calculer un itinéraire et réessayez.
he: המיקום האמיתי של המשתמש אינו ידוע, אנא הפעל את המיקום לפני חישוב מסלול ונסה שוב.
ja: ユーザーの実際の位置情報が不明です。ルートを計算する前に位置情報を有効にして、もう一度お試しください。
pl: Obecna lokalizacja użytkownika jest nieznana, aktywuj pozycjonowanie przed obliczeniem trasy i spróbuj ponownie.
pt: Localização real do usuário é desconhecida, por favor, ative o posicionamento antes de calcular uma rota e tente novamente.
tr: Kullanıcının gerçek konumu bilinmiyor, lütfen bir rota hesaplamadan önce konumlandırmayı etkinleştirin ve tekrar deneyin.

# navigationError.unableToComputeRoute
source: An unexpected error was found while computing the route. Please try again.
ar: تم العثور على خطأ غير متوقع أثناء حساب الطريق. الرجاء المحاولة مرة أخرى.
es: Un error inesperado ha ocurrido mientras se calculaba la ruta. Por favor, vuelve a intentarlo.
fr: Une erreur inattendue a été trouvée lors du calcul de la route. Veuillez réessayer.
he: נמצאה שגיאה בלתי צפויה בעת חישוב המסלול. בבקשה נסה שוב.
ja: ロビーの読み込み中にエラーが発生しました。もう一度お試しください。
pl: Podczas obliczania trasy wykryto nieoczekiwany błąd. Spróbuj ponownie.
pt: Ocorreu um erro inesperado ao calcular a rota. Por favor, tente novamente.
tr: Rota hesaplanırken beklenmeyen bir hata bulundu. Lütfen tekrar deneyin.

# positioning.back
source: Back
ar: عودة
es: Atrás
fr: Précédent
he: חזור
ja: 戻る
pl: Cofnij
pt: Anterior
tr: Geri

# positioning.calibrationNeeded.alert.message
source: Your device's compass isn't calibrated right now. Please recalibrate it to obtain the best navigation experience.
ar: لم يتم معايرة بوصلة جهازك الآن. يرجى إعادة المعايرة للحصول على أفضل تجربة تصفح.
es: La brújula de tu dispositivo no está calibrada. Por favor, vuelve a calibrarla para obtener la mejor experiencia de navegación.
fr: La boussole de votre appareil n'est pas calibrée pour le moment. Veuillez la recalibrer pour obtenir la meilleure expérience de navigation.
he: המצפן של המכשיר שלך לא מכויל כרגע. אנא כייל אותו מחדש כדי לקבל את חווית הניווט הטובה ביותר.
ja: お使いのデバイスのコンパスは現在較正されていません。最適なナビゲーション体験を得るために再校正してください。
pl: Kompas Twojego urządzenia nie jest skalibrowany. Skalibruj go ponownie, aby uzyskać najlepszą jakość nawigacji.
pt: A bússola do seu dispositivo não está calibrada agora. Por favor, recalibre para obter a melhor experiência de navegação.
tr: Cihazınızın pusulası şu anda kalibre edilmedi. En iyi navigasyon deneyimini elde etmek için lütfen yeniden kalibre edin.

# positioning.calibrationNeeded.alert.title
source: Compass calibration needed
ar: فشلت معايرة البوصلة
es: Se necesita calibración de la brújula
fr: Calibration de la boussole nécessaire
he: נדרש כיול מצפן
ja: コンパスのキャリブレーションに失敗しました。
pl: Wymagana kalibracja kompasu
pt: Calibração da bússola necessária
tr: Pusula kalibrasyonu gerekli

# positioning.center
source: Center
ar: الوسط
es: Centrar
fr: Centre
he: מֶרְכָּז
ja: 中央
pl: Wyśrodkuj
pt: Centralizar
tr: merkez

# positioning.createMarker
source: Create marker
ar: إنشاء علامة
es: Crear marcador
fr: Créer le marqueur
he: צור סמן
ja: マーカーを作成
pl: Utwórz znacznik
pt: Criar marcador
tr: İşaret oluştur

# positioning.customDestination
source: Custom destination
ar: الوجهة المخصصة
es: Destino personalizado
fr: Destination personnalisée
he: יעד מותאם אישית
ja: カスタムの保存先
pl: Niestandardowe miejsce docelowe
pt: Destino personalizado
tr: Özel hedef

# positioning.destinationReached.alert.message
source: You've arrived to your destination
ar: لقد وصلت إلى وجهتك
es: Has llegado a tu destino
fr: Vous êtes arrivé à destination
he: הגעתם ליעד
ja: 目的地に到着しました
pl: Dotarłeś do celu
pt: Você chegou ao seu destino
tr: Hedefinize ulaştınız

# positioning.destinationReached.alert.title
source: Destination Reached
ar: مصدر الوجهة
es: Destino alcanzado
fr: Arrivé à la destination
he: היעד הגיע
ja: ゴールに到着
pl: Cel osiągnięty
pt: Destino Alcançado
tr: Hedefe Ulaşıldı

# positioning.error.emptyFloor.alert.message
source: An unexpected error ocurred while downloading the floorplan. Please try again.
ar: حدث خطأ غير متوقع أثناء تحميل معلومات المبنى. الرجاء المحاولة مرة أخرى.
es: Ha ocurrido un error inesperado mientras se descargaba la información del piso. Por favor, vuelve a intentarlo.
fr: Une erreur imprévue s'est produite lors de la connexion avec Amazon. Merci de tenter à nouveau de vous connecter.
he: אירעה שגיאה בלתי צפויה בעת הורדת תכנית הקומה. בבקשה נסה שוב.
ja: ロビーの読み込み中にエラーが発生しました。もう一度お試しください。
pl: Podczas pobierania planu piętra wystąpił nieoczekiwany błąd. Spróbuj ponownie.
pt: Ocorreu um erro inesperado ao baixar o plano de andar. Por favor, tente novamente.
tr: Yer planı indirilirken beklenmeyen bir hata oluştu. Lütfen tekrar deneyin.

# positioning.error.emptyFloor.alert.title
source: Empty floorplan
ar: أرضية فارغة
es: Sin información del piso
fr: Plan de sol vide
he: תוכנית קומה ריקה
ja: 空のフロアプラン
pl: Pusty plan piętra
pt: Plano de pavimento vazio
tr: boş kat planı

# positioning.error.noDestinationSelected.alert.title
source: No destination selected
ar: لم يتم تحديد وجهة
es: No se ha seleccionado un destino
fr: Aucune destination sélectionnée
he: לא נבחר יעד
ja: キャリブレーションが選択されていません
pl: Nie wybrano miejsca docelowego
pt: Nenhum destino selecionado
tr: Hedef seçilmedi

# positioning.error.positionOutdoor.alert.title
source: Outdoor position
ar: مكان داخلي
es: Posición en el exterior
fr: Positionnement extérieur
he: עמדת חוץ
ja: 屋外の位置
pl: Pozycja na zewnątrz
pt: Posição externa
tr: Açık pozisyon

# positioning.error.positionUnknown.alert.title
source: Unknown position
ar: موقع غير معروف
es: Posición desconocida
fr: Position inconnue
he: עמדה לא ידועה
ja: 不明な位置
pl: Nieznana pozycja
pt: Posição desconhecida
tr: bilinmeyen konum

# positioning.error.unableToComputeRoute.alert.title
source: Unable to compute route
ar: غير قادر على حساب المسار
es: No se ha podido calcular la ruta
fr: Impossible de calculer l'itinéraire
he: לא ניתן לחשב מסלול
ja: ルートを計算できません
pl: Nie można obliczyć trasy
pt: Não foi possível calcular a rota
tr: Rota hesaplanamıyor

# positioning.longPressAction.alert.message
source: Select an action:
ar: اختر إجراء:
es: Selecciona una acción:
fr: Sélectionnez une action :
he: בחר פעולה:
ja: アクションの選択
pl: Wybierz akcję:
pt: Selecione uma ação:
tr: Bir eylem seçin:

# positioning.longPressAction.alert.title
source: Long press actions
ar: اجراء الضغط الطويل
es: Acción de pulsación larga
fr: Action lors d'un appui long
he: פעולות לחיצה ארוכה
ja: 長押しアクション
pl: Akcje długiego naciśnięcia
pt: Ações de toque longo
tr: Uzun basın eylemleri

# positioning.numBeacons
source: %d beacons
ar: %d أجهزة إرشاد
fr: Aucune balise
he: %d משואות
pl: %d nadajników (beacon)
pt: %d sinalizadores
tr: %d işaret

# positioning.outsideBuilding.alert.message
source: The user is currently outside of the building. Positioning will resume when the user returns.
ar: المستخدم حاليا خارج المبنى. سيتم استئناف تحديد الموقع عند عودة المستخدم.
es: El usuario está fuera del edificio. El posicionamiento se reestablecerá cuando el usuario regrese al edificio.
fr: L'utilisateur est actuellement en dehors du bâtiment. Le positionnement reprendra lorsque l'utilisateur sera retourné.
he: אין עמדה פנויה. אנא, עבור לאזור מכויל או לאזור עם אות GPS זמין
ja: ユーザーは現在建物の外にいます。ユーザーが戻ったときに位置を再開します。
pl: Brak pozycji. Proszę udać się do skalibrowanego obszaru lub obszaru z dostępnym sygnałem GPS
pt: Não há posição disponível. Por favor, vá para uma área calibrada ou uma área com sinal GPS disponível
tr: Kullanılabilir pozisyon yok. Lütfen kalibre edilmiş bir alana veya GPS sinyalinin mevcut olduğu bir alana gidin

# positioning.outsideBuilding.alert.title
source: User outside building
ar: مستخدم خارج المبنى
es: Usuario fuera de edificio
fr: Utilisateur en dehors du bâtiment
he: משתמש מחוץ לבניין
ja: User not in building
pl: Użytkownik znajduje się poza budynkiem
pt: Usuário fora do edifício
tr: Bina dışında kullanıcı

# positioning.outsideRoute.alert.title
source: User outside route
ar: المسار الخارجي للمستخدم
es: Usuario fuera de ruta
fr: Utilisateur en dehors de la route
he: מסלול מחוץ למשתמש
ja: ルート外のユーザー
pl: Użytkownik jest poza trasą
pt: Usuário fora da rota
tr: Kullanıcı rota dışında

# positioning.searchPois
source: Search Pois
ar: نقاط البحث
es: Buscar Pois
fr: Recherche de Pois
he: חפש את Pois
ja: 毒を検索
pl: Szukaj punktów POI
pt: Pesquisar na Mi
tr: Konum Ara

# search.distance
source: Distance
ar: مسافة
es: Distancia
he: מֶרְחָק
ja: 距離
pl: Odległość
pt: Distância
tr: Mesafe

# search.floor
source: Floor
es: Piso
fr: Etage
he: קוֹמָה
ja: フロア
pl: Piętro
pt: Piso
tr: Zemin

# search.noResultFound
source: No results were found
ar: لَا تُوجَدُ نَتَائِج
es: No se ha encontrado ningún resultado
fr: Aucun résultat trouvé
he: לא נמצאו תוצאות
ja: 検索結果が見つかりませんでした
pl: Nie znaleziono żadnych wyników
pt: Nenhum resultado foi encontrado
tr: hiçbir sonuç bulunamadı

# situmMapsLibrary.error.credentials
source: You must set your auth info with setCredentials() before calling load(buildingWithId:)
ar: يجب عليك تعيين معلومات المصادقة الخاصة بك مع setCredentials() قبل الاتصال بالتحميل (buildingWithId:)
es: Necesitas establecer la información de autenticación con setCredentials() antes de llamar a load(buildingWithId:)
fr: Vous devez définir vos informations d'authentification avec setCredentials() avant d'appeler load(buildingWithId:)
he: עליך להגדיר את פרטי ההסמכה שלך באמצעות setCredentials() לפני שתקרא ל-load(buildingWithId:)
ja: load(buildingWithId:) を呼び出す前に、setCredentials() で認証情報を設定する必要があります。
pl: Musisz ustawić dane uwierzytelniające za pomocą setCredentials() przed wywołaniem load(buildingWithId:)
pt: Você deve definir sua informação de autenticação com setCredentials() antes de chamar load(buildingWithId:)
tr: load(buildingWithId:) öğesini çağırmadan önce kimlik doğrulama bilgilerinizi setCredentials() ile ayarlamanız gerekir.

# situmMapsLibrary.error.invalidBuilding
source: The builidng ID is not correct. Please add a valid building ID in LibrarySettings
ar: معرف البناء غير صحيح. الرجاء إضافة معرف بناء صالح في إعدادات المكتبة
es: El identificador del edificio no es correcto. Por favor, introduce un identificador correcto en LibrarySettings
fr: L'ID Builidng n'est pas correct. Veuillez ajouter un ID de bâtiment valide dans les paramètres de bibliothèque
he: מזהה הבניין אינו נכון. אנא הוסף מזהה בניין חוקי בהגדרות Library
ja: 組み込みIDが正しくありません。LibrarySettings で有効な建物IDを追加してください。
pl: Identyfikator budynku jest nieprawidłowy. Dodaj prawidłowy identyfikator budynku w LibrarySettings
pt: O ID do builidng não está correto. Por favor adicione um ID de construção válido em Configurações de Biblioteca
tr: Bina kimliği doğru değil. Lütfen LibrarySettings'te geçerli bir bina kimliği ekleyin

# wayfindingError.invalidPoi
source: The poi selected is not valid in this building
ar: الشعر المحدد غير صالح في هذا المبنى
es: El poi seleccionado no es válido en este edificio
fr: Le poi sélectionné n'est pas valide dans ce bâtiment
he: ה-POI שנבחר אינו תקף בבניין זה
ja: 選択されたポイはこの建物では無効です
pl: Wybrany punkt POI nie jest prawidłowy w tym budynku
pt: O poi selecionado não é válido neste prédio
tr: Seçilen ilgi noktası bu binada geçerli değil

# wayfindingError.unknown
source: An unknown error happened
ar: حدث خطأ غير معروف
es: Ha ocurrido un error inesperado
fr: Une erreur inconnue est survenue
he: קרתה שגיאה לא ידועה
ja: 不明なエラーが発生しました
pl: Wystąpił nieznany błąd
pt: Aconteceu um erro desconhecido
tr: Bilinmeyen bir hata oluştu
